Repository: MX-Linux/mx-tour
Catalog: pomo/mx-tour_*.po
Languages: de

source: You may have wondered about the Clock in the upper right corner of your screen, its a Conky. Conky is a light-weight system monitor that can display any kind of information on your desktop, either as text, or using simple progress bars and graph widgets, with different fonts and colors. It can display the status of the CPU, memory, disk storage, temperatures, network interfaces, battery power, e-mail inboxes, many popular music players, weather updates, news feeds, and much more. MX Linux comes with many different Conkies to choose from or edit. MX Linux comes with three tools for Conky: • Conky Toggle - to easily turn Conky off or on • MX Conky - enables detailed changes to the actively running Conky • Conky Manager - utility for managing and viewing Conky configuration files
de: Vielleicht haben Sie sich schon über die Uhr in der oberen rechten Ecke Ihres Bildschirms gewundert, es ist ein Conky. Conky ist ein leichtgewichtiger Systemmonitor, der jede Art von Information auf Ihrem Desktop anzeigen kann, entweder als Text oder mit einfachen Fortschrittsbalken und Grafik-Widgets, mit verschiedenen Schriftarten und Farben. Es kann den Status der CPU, des Arbeitsspeichers, des Festplattenspeichers, der Temperaturen, der Netzwerkschnittstellen, der Batterieleistung, des E-Mail-Posteingangs, vieler beliebter Musikplayer, des Wetters, der Newsfeeds und vieles mehr anzeigen. MX Linux wird mit vielen verschiedenen Conkies geliefert, aus denen Sie auswählen oder die Sie bearbeiten können. MX Linux wird mit drei Tools für Conky geliefert: - Conky Toggle - um Conky einfach ein- oder auszuschalten - MX Conky - ermöglicht detaillierte Änderungen an dem aktiv laufenden Conky - Conky Manager - Dienstprogramm zur Verwaltung und Anzeige von Conky-Konfigurationsdateien

source: Docklike Taskbar is a lightweight, modern, and minimalist application taskbar that sits in the panel below the clock. It starts with Firefox browser and Thunar File Manager pinned on it. A few things to know about Docklike Taskbar are that you can: (1) "Pin" an open application by Right-Clicking and checking "Pin to Dock" (2) Customize the look and feel by Right-Clicking between two icons and selecting (3) Properties The Docklike Taskbar (3) Properties can also be accessed from the Panel Tab of MX Tweak.
de: Docklike Taskbar ist eine leichtgewichtige, moderne und minimalistische Anwendungs-Taskleiste, die sich in der Leiste unter der Uhr befindet. Sie beginnt mit dem Firefox-Browser und dem Thunar-Dateimanager, die daran angeheftet sind. Ein paar Dinge, die Sie über Docklike Taskbar wissen sollten, sind, dass Sie: (1) eine geöffnete Anwendung mit einem Rechtsklick und der Option "An das Dock anheften" anheften (2) das Aussehen anpassen, indem Sie mit der rechten Maustaste zwischen zwei Symbolen klicken und (3) Eigenschaften auswählen Die Eigenschaften der Dock-ähnlichen Taskleiste (3) können auch über die Registerkarte "Panel" von MX Tweak aufgerufen werden.

source: MX Package Installer, often referred to simply as MXPI, allows you to search for, install, or remove packages and applications quickly, safely, and easily. It is comprised of Tabs which allow you to manage "Popular Applications" and any package in the MX/Debian Stable, the MX Test, Debian Backports, and Flatpak repositories. The Popular Applications tab is organized by categories for easy searching and installation. The MX Test Repo tab is a safe and effective way to install new incoming applications that are waiting to be moved to the MX Stable repositories. The Search function located in the upper right can help you locate applications easier. And the Console Output tab can help you troubleshoot installation or removal issues.
de: MX Package Installer, oft einfach als MXPI bezeichnet, ermöglicht es Ihnen, schnell, sicher und einfach nach Paketen und Anwendungen zu suchen, sie zu installieren oder zu entfernen. Er besteht aus Registerkarten, mit denen Sie "Beliebte Anwendungen" und alle Pakete in den MX/Debian Stable-, MX Test-, Debian Backports- und Flatpak-Repositories verwalten können. Die Registerkarte "Beliebte Anwendungen" ist für eine einfache Suche und Installation nach Kategorien geordnet. Die Registerkarte MX Test Repo ist ein sicherer und effektiver Weg, um neue Anwendungen zu installieren, die darauf warten, in die MX Stable-Repositorien verschoben zu werden. Die Suchfunktion oben rechts kann Ihnen helfen, Anwendungen leichter zu finden. Und die Registerkarte Konsolenausgabe hilft Ihnen bei der Fehlersuche bei der Installation oder Entfernung.

source: MX Snapshot allows you to create a bootable live-CD/DVD ISO of your currently running MX Linux or antiX system/installation. The bootable live-CD/DVD ISO can be used as a recovery method or to install on other systems. Two types of Snapshot ISOs can be created: “Personal Snapshot” - saves almost everything, used to backup your current system, and personal files “System Snapshot” - with apps you installed and without ones you removed, and no personal files
de: Mit MX-Snapshot können Sie eine bootfähige Live-CD/DVD-ISO Ihres laufenden MX Linux- oder antiX-Systems/ihrer laufenden Installation erstellen. Die bootfähige Live-CD/DVD-ISO kann als Wiederherstellungsmethode oder zur Installation auf anderen Systemen verwendet werden. Es können zwei Arten von Snapshot-ISOs erstellt werden: "Personal Snapshot" - speichert fast alles, dient zur Sicherung des aktuellen Systems und der persönlichen Dateien "System Snapshot" - mit installierten Anwendungen und ohne diejenigen, die Sie entfernt haben, und ohne persönliche Dateien

source: Many applications have been developed specifically for MX Linux, adapted or brought over from antiX Linux, or adapted from outside sources to save you effort with important tasks often involving unintuitive steps. The MX Tools dashboard (shown above), centralizes and organizes these tools for easy access and use. Lets explore some MX Tools to help you setup and use your computer.
de: Viele Anwendungen wurden speziell für MX Linux entwickelt, von antiX Linux übernommen oder von externen Quellen adaptiert, um Ihnen bei wichtigen Aufgaben, die oft unintuitive Schritte erfordern, Arbeit zu ersparen. Das MX Tools Dashboard (siehe oben) zentralisiert und organisiert diese Tools für einen einfachen Zugriff und Gebrauch. Sehen wir uns einige MX-Tools an, die Ihnen bei der Einrichtung und Nutzung Ihres Computers helfen.

source: MX Tweak brings together a number of small but often used customizations organized under different Tabs. Tabs Overview: • Panel - change the location and orientation of the panel, access the Docklike Taskbar properties • Theme - select a Theme Set and or individual Application, Window Manager, and Icon themes • Compositor - change commonly needed Window Manager Compositor options • Display - change Desktop scaling, monitor resolution, and brightness settings • Config Options - change Single-Click and Double-Click options and enable Desktop Zoom • Other - enable mounting internal drives by non-administrators, TearFree rendering, and switching the account used for administrative actions
de: MX Tweak fasst eine Reihe kleiner, aber häufig verwendeter Anpassungen zusammen, die unter verschiedenen Registerkarten organisiert sind. Übersicht der Registerkarten: - Panel - Ändern Sie die Position und Ausrichtung des Panels, greifen Sie auf die Eigenschaften der Dock-ähnlichen Taskleiste zu - Thema - Auswahl eines Themensatzes oder einzelner Anwendungs-, Fenstermanager- und Icon-Themen - Compositor - Ändern Sie häufig benötigte Compositor-Optionen für den Fenstermanager - Anzeige - Ändern der Desktop-Skalierung, der Monitorauflösung und der Helligkeitseinstellungen - Konfigurationsoptionen - Ändern der Einzel- und Doppelklick-Optionen und Aktivieren des Desktop-Zooms - Andere - Aktivieren Sie das Mounten interner Laufwerke durch Nicht-Administratoren, TearFree-Rendering und das Umschalten des Kontos für administrative Aktionen

source: MX Updater sits in the Notification Area of the panel. The icon turns green when updates are available and notifications will also alert you that updates exist. Left-Clicking the icon opens a window showing availabe updates Right-Clicking the icon brings up a menu with many options, such as: (1) View and Upgrade - opens a window showing availabe updates (2) Check for Updates - checks to more updates (3) Preferences - opens the preferences window
de: MX Updater befindet sich im Benachrichtigungsbereich des Panels. Das Symbol wird grün, wenn Updates verfügbar sind, und Benachrichtigungen weisen Sie darauf hin, dass Updates vorhanden sind. Wenn Sie mit der linken Maustaste auf das Symbol klicken, öffnet sich ein Fenster mit den verfügbaren Updates. Wenn Sie mit der rechten Maustaste auf das Symbol klicken, öffnet sich ein Menü mit vielen Optionen, wie z. B.: (1) Anzeigen und aktualisieren - öffnet ein Fenster mit den verfügbaren Aktualisierungen (2) Nach Updates suchen - prüft auf weitere Updates (3) Einstellungen - öffnet das Einstellungsfenster

source: When you booted your system for the first time, you should have noticed a Welcome screen that appeared in the center of the screen that offers quick orientation and help links for new and veteran users. You can access MX Welcome again by finding it in the main Wisker Menu discussed next or by opening the MX Tools application. You can use the 'Show this dialog at start up' checkbox (as shown above) if you would like to see MX Welcome each time your system starts and uncheck it when you no longer need it.
de: Als Sie Ihr System zum ersten Mal hochgefahren haben, sollte Ihnen ein Willkommensbildschirm in der Mitte des Bildschirms aufgefallen sein, der eine schnelle Orientierung und Hilfe-Links für neue und erfahrene Benutzer bietet. Sie können MX Welcome erneut aufrufen, indem Sie es im Wisker-Hauptmenü (siehe unten) finden oder indem Sie die Anwendung MX Tools öffnen. Sie können das Kontrollkästchen "Dieses Dialogfeld beim Starten anzeigen" (wie oben gezeigt) verwenden, wenn Sie MX Welcome bei jedem Systemstart sehen möchten, und es deaktivieren, wenn Sie es nicht mehr benötigen.

source: You've probably noticed that the default desktop of MX Linux has a single vertical panel on the left side of the screen. This may be very different to what you are normally used to, but it saves screen space for your applications, and it can become very natural after a short amount of time. The panel orientation is easily changeable in MX Tools > MX Tweak. Even more options to customize your panel exist under Settings Manager > Panel Lets explore some of the key components of the panel. (1) Whisker Menu (Application Menu) (2) Notification Area consists of (from top to bottom) • Volume manager • USB ejector • Clipboard manager • Network manager • Update manager • Power manager (3) Docklike Taskbar (Application Switcher) • Firefox browser • Thunar File Manager (4) Clock (Date Time) • Left-Click to open a calendar • Right-Click to change the properties (5) Power Button which opens a window to • Log Out • Restart • Shutdown • Suspend
de: Sie haben wahrscheinlich bemerkt, dass der Standard-Desktop von MX Linux ein einziges vertikales Panel auf der linken Seite des Bildschirms hat. Das ist vielleicht etwas anders, als Sie es gewohnt sind, aber es spart Platz für Ihre Anwendungen und kann nach kurzer Zeit sehr natürlich wirken. Die Ausrichtung des Bedienfelds kann unter MX Tools > MX Tweak leicht geändert werden. Weitere Optionen zum Anpassen des Bedienfelds finden Sie unter Settings Manager > Panel Sehen wir uns einige der wichtigsten Komponenten des Bedienfelds an. (5) Einschalttaste, die ein Fenster öffnet zum - Abmelden - Neustart - Herunterfahren - Suspendieren (4) Uhr (Datum Uhrzeit) - Links-Klick zum Öffnen eines Kalenders - Rechts-Klick zum Ändern der Eigenschaften (3) Dockähnliche Taskleiste (Anwendungsumschalter) - Firefox-Browser - Thunar Dateimanager (2) Der Benachrichtigungsbereich besteht aus (von oben nach unten) - Lautstärkemanager - USB-Ausstoßer - Zwischenablage-Manager - Netzwerk-Manager - Update-Manager - Energie-Manager (1) Whisker-Menü (Anwendungsmenü)

source: Quick System Info, also known as QSI, is a great and easy way to get a lot of information about your computer hardware and MX Linux installation. The output is automatically copied to the clipboard, it can also be pasted directly into a MX Forum post complete with code tags, or pasted into a Text document for use later. It is important to include your QSI when asking for help on the MX Forum so that the MX Community can better help you. FAQ: QSI automatically filters potentially sensitive information, this information will instead show as "<filter>".
de: Quick System Info, auch bekannt als QSI, ist eine großartige und einfache Möglichkeit, viele Informationen über Ihre Computerhardware und MX Linux-Installation zu erhalten. Die Ausgabe wird automatisch in die Zwischenablage kopiert. Sie kann auch direkt in einen MX-Forum-Beitrag mit Code-Tags oder in ein Textdokument zur späteren Verwendung eingefügt werden. Es ist wichtig, dass Sie Ihre QSI angeben, wenn Sie im MX Forum um Hilfe bitten, damit die MX Community Ihnen besser helfen kann. FAQ: QSI filtert automatisch potentiell sensible Informationen, diese Informationen werden stattdessen als "<filter>" angezeigt.

source: Timeshift is an application that provides functionality similar to the System Restore feature in Windows and the Time Machine tool in Mac OS. Timeshift protects your system by taking incremental snapshots of the file system and settings at scheduled intervals. These snapshots can be restored at a later date to undo all changes to the system. When you open Timeshift the first time, a Setup Wizard will run allowing you to select the location the snapshots are saved to, the schedule, and if you want to include personal files or not. You can rerun the Setup Wizard or change these settings at any time. User files such as documents, pictures and music are excluded by default. This ensures that your personal files remain unchanged when you restore your system to an earlier date. ATTENTION! • Pay attention to the Snapshot schedule and disk space. You can uncheck all boxes to make only on demand snapshots. • Timeshift is NOT a backup tool, for full system backups please use MX Snapshot or luckyBackup.
de: Timeshift ist eine Anwendung, die ähnliche Funktionen wie die Systemwiederherstellung in Windows und das Tool Time Machine in Mac OS bietet. Timeshift schützt Ihr System, indem es in regelmäßigen Abständen inkrementelle Schnappschüsse des Dateisystems und der Einstellungen anfertigt. Diese Schnappschüsse können zu einem späteren Zeitpunkt wiederhergestellt werden, um alle Änderungen am System rückgängig zu machen. Wenn Sie Timeshift zum ersten Mal öffnen, wird ein Setup-Assistent ausgeführt, mit dem Sie den Speicherort für den Snapshot und den Zeitplan festlegen und entscheiden können, ob Sie persönliche Dateien einbeziehen möchten oder nicht. Sie können den Einrichtungsassistenten jederzeit erneut starten oder diese Einstellungen ändern. Benutzerdateien wie Dokumente, Bilder und Musik sind standardmäßig ausgeschlossen. Dadurch wird sichergestellt, dass Ihre persönlichen Dateien unverändert bleiben, wenn Sie Ihr System zu einem früheren Zeitpunkt wiederherstellen. ACHTUNG! - Achten Sie auf den Snapshot-Zeitplan und den Speicherplatz. Sie können alle Kontrollkästchen deaktivieren, um nur bei Bedarf Schnappschüsse zu erstellen. - Timeshift ist KEIN Backup-Tool, für vollständige Systemsicherungen verwenden Sie bitte MX Snapshot oder luckyBackup.

source: Using a new Operating System for the first time can seem challenging and scary. MX Tour is designed to introduce and orient you to many of the features and graphical tools of the Xfce Edition of MX Linux. Each of the topic areas have been separated into Tabs on the far left. You can navigate these Tabs by clicking on them or using the Up and Down arrow keys on your keyboard. We hope you find this tour useful!
de: Die erstmalige Verwendung eines neuen Betriebssystems kann herausfordernd und beängstigend erscheinen. Die MX Tour wurde entwickelt, um Sie in viele der Funktionen und grafischen Tools der Xfce Edition von MX Linux einzuführen und zu orientieren. Jeder der Themenbereiche ist in Registerkarten auf der linken Seite unterteilt. Sie können durch diese Registerkarten navigieren, indem Sie auf sie klicken oder die Pfeiltasten nach oben und unten auf Ihrer Tastatur verwenden. Wir hoffen, Sie finden diese Tour nützlich!

source: The Whisker Menu (Applications Menu) is a easly to use and flexible main menu. It consists of four main areas. (1) Application Categories (2) Individual Applications (3) System Quick Links (4) Search bar You can open the Whisker Menu by Left-Clicking on it or pressing the "Windows" key on your keyboard. You can browse through all of your installed applications by clicking on the categories on the side. Additionally, Whisker Menu keeps a list of the last ten Recently Used applications. When you first open it you are shown a list of applications marked as favorites. Favorites are easy to add, reorder, and remove by Right-Clicking on any application and select “Add to Favorites”. Simply drag and drop your favorites list to arrange them. You can remove them at any time from another Right-Click option. If you’re not sure exactly where a program is listed, the search field is automatically focused when opening the menu, so you can just start typing an application name or general words such as "browser". You can edit the Whisker Menu properties by Righ-Clicking on it.
de: Das Whisker-Menü (Anwendungsmenü) ist ein einfach zu bedienendes und flexibles Hauptmenü. Es besteht aus vier Hauptbereichen. (1) Anwendungskategorien (2) Einzelne Anwendungen (3) System-Schnelllinks (4) Suchleiste Sie können das Whisker-Menü öffnen, indem Sie es mit der linken Maustaste anklicken oder die "Windows"-Taste auf Ihrer Tastatur drücken. Sie können durch alle Ihre installierten Anwendungen blättern, indem Sie auf die Kategorien an der Seite klicken. Außerdem enthält Whisker Menu eine Liste der letzten zehn zuletzt verwendeten Anwendungen. Wenn Sie das Programm zum ersten Mal öffnen, wird eine Liste der als Favoriten markierten Anwendungen angezeigt. Favoriten lassen sich leicht hinzufügen, neu anordnen und entfernen, indem Sie mit der rechten Maustaste auf eine beliebige Anwendung klicken und "Zu Favoriten hinzufügen" wählen. Ziehen Sie Ihre Favoritenliste einfach per Drag & Drop, um sie anzuordnen. Sie können sie jederzeit über eine andere Rechtsklick-Option wieder entfernen. Wenn Sie sich nicht sicher sind, wo genau ein Programm aufgelistet ist, wird das Suchfeld beim Öffnen des Menüs automatisch fokussiert, so dass Sie einfach den Namen einer Anwendung oder allgemeine Wörter wie "Browser" eingeben können. Sie können die Eigenschaften des Whisker-Menüs bearbeiten, indem Sie mit der rechten Maustaste darauf klicken.
